{
  "latest": "2024-10-10",
  "url": "https://raw.githubusercontent.com/xvwyh/BuildPad/refs/heads/master/arcdps_buildpad.dll",
  "history": [
    {
      "version": "2024-10-10",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2024-10-10.dll",
      "changes": [
        { "type": "feature", "text": "Updated weapon and pet selection popups to Janthir Wilds" },
        { "type": "bug", "text": "Fixed settings category selection panel becoming so narrow that it starts clipping \"Save\" and \"Load\" buttons" },
        { "type": "bug", "text": "BuildPad will now attempt to load necessary data from GitHub as a fallback in case the main website is inaccessible" },
        { "type": "misc", "text": "Added 10 seconds timeout to web requests" }
      ]
    },
    {
      "version": "2023-07-19",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2023-07-19.dll",
      "changes": [
        { "type": "feature", "text": "Added support for new build chat link format that includes data about weapons and weapon skill customizations" },
        { "type": "feature", "text": "Added support for editing the list of weapons used in a build template (currently not used by the game, only to display tooltips and build inspect UI)" },
        { "type": "feature", "text": "Transitioned to using ArcDPS's built-in autoupdater for extensions. BuildPad will now be silently updated upon launching Guild Wars 2" },
        { "type": "warning", "text": "If you encounter issues when updating BuildPad to this version - delete all files in your /Guild Wars 2/bin64/ folder that start with either \"d3d9_arcdps_buildpad\" or \"arcdps_buildpad\" and manually download and install the new version from the website" },
        { "type": "bug", "text": "Fixed loading builds with extra long descriptions" },
        { "type": "bug", "text": "Fixed parsing builds if more than one chat code was pasted into the textbox" },
        { "type": "bug", "text": "Better sanitization when pasting text from clipboard to avoid unexpected unicode characters breaking build saving" },
        { "type": "bug", "text": "Build list will now be darkened while dragging builds around" },
        { "type": "bug", "text": "Reorganized the settings panel and made it accessible from under ArcDPS extension settings tab" },
        { "type": "misc", "text": "Starting with the next version BuildPad's DLL will be named \"arcdps_buildpad.dll\". This version will automatically rename itself after closing Guild Wars 2" },
        { "type": "misc", "text": "Downloaded render cache will be automatically cleaned up when starting this version for the first time" },
        { "type": "misc", "text": "ArcDPS extension signature changed to 0x92F80465" }
      ]
    },
    {
      "version": "2021-10-27",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-10-27.dll",
      "changes": [
        { "type": "feature", "text": "Added support for Mechanist, Specter and Untamed" },
        { "type": "misc", "text": "2022-03-02 Notice: Serverside data updated for EoD's release. BuildPad update is not required, but you may want to empty your \\addons\\arcdps\\arcdps.buildpad\\rendercache\\ folder (or at least delete the files from 2479302 onwards) to download final art for new specializations, traits and skills" }
      ]
    },
    {
      "version": "2021-09-24",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-09-24.dll",
      "changes": [
        { "type": "feature", "text": "Added DirectX 11 support" }
      ]
    },
    {
      "version": "2021-09-22",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-09-22.dll",
      "changes": [
        { "type": "feature", "text": "Added support for Catalyst, Bladesworn and Vindicator" }
      ]
    },
    {
      "version": "2021-08-18",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-08-18.dll",
      "changes": [
        { "type": "feature", "text": "Added support for Harbinger, Willbender and Virtuoso" },
        { "type": "feature", "text": "Added in-game-like overlay to skills not usable underwater" },
        { "type": "misc", "text": "Refactored API icons to avoid unloading shared textures and race condition in downloading textures" }
      ]
    },
    {
      "version": "2021-03-17",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-03-17.dll",
      "changes": [
        { "type": "bug", "text": "Another fix to -mumble command line argument handling, fixes missing profession filter when Guild Wars 2 was started through GW2Launcher configured to use a custom mumble link name" }
      ]
    },
    {
      "version": "2021-02-23",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2021-02-23.dll",
      "changes": [
        { "type": "bug", "text": "Support for the new version of ArcDPS with transition to ImGui v1.80" },
        { "type": "warning", "text": "Manual update necessary" }
      ]
    },
    {
      "version": "2020-08-30",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-08-30.dll",
      "changes": [
        { "type": "bug", "text": "Added support for -mumble command line argument, fixes missing profession filter when Guild Wars 2 was started through Launchbuddy" }
      ]
    },
    {
      "version": "2020-08-25",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-08-25.dll",
      "changes": [
        { "type": "bug", "text": "Fixed Revenant build templates after the 2020-08-25 Guild Wars 2 patch" },
        { "type": "bug", "text": "Previously saved Revenant build templates will be automatically updated to be compatible with the new patch" },
        { "type": "bug", "text": "Pasting a build template code that was created prior to 2020-08-25 patch will require manually selecting legends, as it's now impossible to know whether the code was created before or after the 2020-06-09 patch" },
        { "type": "misc", "text": "Attempt to fix some texture unloading issues" }
      ]
    },
    {
      "version": "2020-06-11",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-06-11.dll",
      "changes": [
        { "type": "bug", "text": "Fixed Revenant build templates after the 2020-06-09 Guild Wars 2 patch" },
        { "type": "bug", "text": "Previously saved Revenant build templates will be automatically updated to be compatible with the new patch" },
        { "type": "bug", "text": "Any new Revenant build templates that were added since the previous BuildPad version (2020-06-10) may have corrupted legends. You will have to fix them manually, this will be your punishment for not heeding the warning" }
      ]
    },
    {
      "version": "2020-06-10",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-06-10.dll",
      "changes": [
        { "type": "bug", "text": "Build templates are currently broken both in Guild Wars 2 and in BuildPad as the result of unexpected Revenant legend ID changes. This is a temporary fix to allow BuildPad to load using fallback API data, but Revenant build templates are not functional: builds created in BuildPad will not work in the game, and attempting to paste a build from the game with Ventari legend can outright cause a crash! A new update will be released once it's clear if the new IDs are here to stay, avoid using Revenant builds in the meantime." }
      ]
    },
    {
      "version": "2020-05-23",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-05-23.dll",
      "changes": [
        { "type": "feature", "text": "Added metabattle.com item stat icons to ArcDPS gear templates preview window" },
        { "type": "bug", "text": "Fixed an issue that prevented item stat icons from loading" },
        { "type": "bug", "text": "Fixed Daredevil icon being used as the profession icon for Thief. Oops..." }
      ]
    },
    {
      "version": "2020-03-14",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-03-14.dll",
      "changes": [
        { "type": "feature", "text": "Added new filtering flags for PvP and WvW. They are hidden by default and can be enabled in Settings > Toggle Flags" },
        { "type": "bug", "text": "Fixed builds window toggle keybind not working on the very first launch" }
      ]
    },
    {
      "version": "2020-02-26",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2020-02-26.dll",
      "changes": [
        { "type": "bug", "text": "Skill data is now loaded almost exclusively from the API, keeping it always up to date with balance changes" }
      ]
    },
    {
      "version": "2019-12-26",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-26.dll",
      "changes": [
        { "type": "bug", "text": "Fixed profession palette not using localized profession names" },
        { "type": "bug", "text": "Fixed missing localization of specialization names in \"Copy Traits as Numbers\" menu button" },
        { "type": "bug", "text": "Fixed incorrect line ending in \"Copy as Text\" menu button, which could lead to some Windows text editors not displaying line breaks" },
        { "type": "bug", "text": "Fixed potential memory corruption when changing API language while some API requests are still in progress" },
        { "type": "bug", "text": "All textures are now unloaded together with BuildPad to fix d912pxy memory leak reports" }
      ]
    },
    {
      "version": "2019-12-12",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-12.dll",
      "changes": [
        { "type": "bug", "text": "Fixed builds failing to load names longer than 100 characters" },
        { "type": "misc", "text": "Limited the width of build tooltips to 400px" }
      ]
    },
    {
      "version": "2019-12-04a",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-04a.dll",
      "changes": [
        { "type": "bug", "text": "Fixed skill selection not being shown for inactive revenant legend if there was no active legend selected" },
        { "type": "bug", "text": "Fixed being unable to select \"Inspiring Reinforcement\" as an aquatic revenant skill" }
      ]
    },
    {
      "version": "2019-12-04",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-04.dll",
      "changes": [
        { "type": "feature", "text": "Added support for storage and editing of utility skills of inactive revenant legends" }
      ]
    },
    {
      "version": "2019-12-03",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-03.dll",
      "changes": [
        { "type": "feature", "text": "Builds can now be edited in detail as well as created from scratch: profession, specializations, skills, traits, pets and legends can now be changed at any time by clicking \"Edit\" either from the build's context menu, or from under the quill button" },
        { "type": "feature", "text": "Flags can now be right-clicked when editing a build to display them next to the profession icon in the build list" },
        { "type": "feature", "text": "Changed how flag filtering works: flags from separate groups will now filter by intersection, e.g. filtering by Raid and Power will now only show builds that have both Raid AND Power flags, as opposed to the previous behavior where all builds that had either Raid OR Power or both were shown. Filtering by multiple flags within the same group will still filter additively, so e.g. filtering by Power and Condition will still show builds that have either Power or Condition or both. You can revert back to the old behavior from the settings menu, if this \"breaks your workflow\"" },
        { "type": "feature", "text": "ArcDPS gear templates preview window will now display which skin slots (helm, shoulders, gloves, backpiece) were hidden when the template was saved" },
        { "type": "bug", "text": "Fixed pressing Tab erroneously focusing keyboard input on search box when the window becomes visible" },
        { "type": "bug", "text": "Fixed Kalla legend being selectable in aquatic slots" },
        { "type": "bug", "text": "Added some basic build validation to prevent crashes on invalid chat links" },
        { "type": "misc", "text": "Removed multiple revenant skill arrangements when migrating from ArcDPS, since now the skill order can freely be changed by hand" },
        { "type": "misc", "text": "Removed /addons/arcdps/arcdps.buildpad/version file: from now on only the latest version of BuildPad present in /bin64/ will be loaded" },
        { "type": "misc", "text": "Reduced blurriness of Raid flag icon" }
      ]
    },
    {
      "version": "2019-11-06",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-11-06.dll",
      "changes": [
        { "type": "feature", "text": "Builds can now be assigned a keybind to instantly copy them to clipboard. Keybinds only work for current profession's builds, so it's possible to have multiple builds of different professions sharing the same keybinds" },
        { "type": "feature", "text": "Keybinds can now be optionally set up to be passed-through to Guild Wars 2, allowing the game client to execute its own actions in reaction to pressed keys" },
        { "type": "feature", "text": "ArcDPS gear templates preview window can now display gw2skills.net icons to represent item stat combos" },
        { "type": "feature", "text": "Added a setting to change UI scaling of BuildPad windows" },
        { "type": "feature", "text": "Added a setting to hide the main window's header" },
        { "type": "feature", "text": "Added a setting to clear filters when hiding the main window" },
        { "type": "feature", "text": "Added a setting to make filter buttons more opaque when using highly transparent window background color" },
        { "type": "bug", "text": "Fixed BuildPad not using ArcDPS font if SCT plugin is also installed" },
        { "type": "bug", "text": "Fixed \"Dismiss\" buttons not being clickable if both \"ArcDPS migration\" and \"New version available\" messages were visible at the same time" },
        { "type": "bug", "text": "Fixed tooltip for currently edited build incorrectly representing the original build's data instead of the edited one's" },
        { "type": "misc", "text": "Main window can no longer be collapsed into the header due to the very unreliable nature of double-clicking in ArcDPS" }
      ]
    },
    {
      "version": "2019-10-31",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-10-31.dll",
      "changes": [
        { "type": "feature", "text": "First public release" }
      ]
    }
  ],
  "colors": {
    "feature": "#AAFF00FF",
    "bug": "#FFFFFFFF",
    "misc": "#808080FF",
    "warning": "#FF4400FF"
  }
}