{
  "latest": "2019-12-04a",
  "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-04a.dll",
  "history": [
    {
      "version": "2019-12-04a",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-04a.dll",
      "changes": [
        { "type": "bug", "text": "Fixed skill selection not being shown for inactive revenant legend if there was no active legend selected" },
        { "type": "bug", "text": "Fixed being unable to select \"Inspiring Reinforcement\" as an aquatic revenant skill" }
      ]
    },
    {
      "version": "2019-12-04",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-04.dll",
      "changes": [
        { "type": "feature", "text": "Added support for storage and editing of utility skills of inactive revenant legends" }
      ]
    },
    {
      "version": "2019-12-03",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-12-03.dll",
      "changes": [
        { "type": "feature", "text": "Builds can now be edited in detail as well as created from scratch: profession, specializations, skills, traits, pets and legends can now be changed at any time by clicking \"Edit\" either from the build's context menu, or from under the quill button" },
        { "type": "feature", "text": "Flags can now be right-clicked when editing a build to display them next to the profession icon in the build list" },
        { "type": "feature", "text": "Changed how flag filtering works: flags from separate groups will now filter by intersection, e.g. filtering by Raid and Power will now only show builds that have both Raid AND Power flags, as opposed to the previous behavior where all builds that had either Raid OR Power or both were shown. Filtering by multiple flags within the same group will still filter additively, so e.g. filtering by Power and Condition will still show builds that have either Power or Condition or both. You can revert back to the old behavior from the settings menu, if this \"breaks your workflow\"" },
        { "type": "feature", "text": "ArcDPS gear templates preview window will now display which skin slots (helm, shoulders, gloves, backpiece) were hidden when the template was saved" },
        { "type": "bug", "text": "Fixed pressing Tab erroneously focusing keyboard input on search box when the window becomes visible" },
        { "type": "bug", "text": "Fixed Kalla legend being selectable in aquatic slots" },
        { "type": "bug", "text": "Added some basic build validation to prevent crashes on invalid chat links" },
        { "type": "misc", "text": "Removed multiple revenant skill arrangements when migrating from ArcDPS, since now the skill order can freely be changed by hand" },
        { "type": "misc", "text": "Removed /addons/arcdps/arcdps.buildpad/version file: from now on only the latest version of BuildPad present in /bin64/ will be loaded" },
        { "type": "misc", "text": "Reduced blurriness of Raid flag icon" }
      ]
    },
    {
      "version": "2019-11-06",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-11-06.dll",
      "changes": [
        { "type": "feature", "text": "Builds can now be assigned a keybind to instantly copy them to clipboard. Keybinds only work for current profession's builds, so it's possible to have multiple builds of different professions sharing the same keybinds" },
        { "type": "feature", "text": "Keybinds can now be optionally set up to be passed-through to Guild Wars 2, allowing the game client to execute its own actions in reaction to pressed keys" },
        { "type": "feature", "text": "ArcDPS gear templates preview window can now display gw2skills.net icons to represent item stat combos" },
        { "type": "feature", "text": "Added a setting to change UI scaling of BuildPad windows" },
        { "type": "feature", "text": "Added a setting to hide the main window's header" },
        { "type": "feature", "text": "Added a setting to clear filters when hiding the main window" },
        { "type": "feature", "text": "Added a setting to make filter buttons more opaque when using highly transparent window background color" },
        { "type": "bug", "text": "Fixed BuildPad not using ArcDPS font if SCT plugin is also installed" },
        { "type": "bug", "text": "Fixed \"Dismiss\" buttons not being clickable if both \"ArcDPS migration\" and \"New version available\" messages were visible at the same time" },
        { "type": "bug", "text": "Fixed tooltip for currently edited build incorrectly representing the original build's data instead of the edited one's" },
        { "type": "misc", "text": "Main window can no longer be collapsed into the header due to the very unreliable nature of double-clicking in ArcDPS" }
      ]
    },
    {
      "version": "2019-10-31",
      "url": "https://buildpad.gw2archive.eu/versions/d3d9_arcdps_buildpad_2019-10-31.dll",
      "changes": [
        { "type": "feature", "text": "First public release" }
      ]
    }
  ],
  "colors": {
    "feature": "#AAFF00FF",
    "bug": "#FFFFFFFF",
    "misc": "#808080FF",
    "warning": "#FF4400FF"
  }
}